using System;

namespace ParamLibrary.Application
{
	public class CmdParam
	{
		public static string CON_CMWAP_IP;

		public static string CON_CMWAP_PORT;

		static CmdParam()
		{
			CmdParam.CON_CMWAP_IP = "10.0.0.172";
			CmdParam.CON_CMWAP_PORT = "80";
		}

		public CmdParam()
		{
		}

		public static int TrafficProtocolCodeExchange(int sourceCode)
		{
			int num;
			int num1 = sourceCode;
			if (num1 <= 24)
			{
				if (num1 == 3)
				{
					num = 768;
					return num;
				}
				switch (num1)
				{
					case 9:
					{
						num = 65281;
						break;
					}
					case 10:
					{
						num = 65282;
						break;
					}
					case 11:
					{
						num = 65284;
						break;
					}
					case 12:
					{
						num = 65283;
						break;
					}
					case 13:
					case 14:
					case 15:
					{
						num = sourceCode;
						return num;
					}
					case 16:
					{
						num = 768;
						break;
					}
					default:
					{
						switch (num1)
						{
							case 21:
							{
								num = 277;
								break;
							}
							case 22:
							{
								num = sourceCode;
								return num;
							}
							case 23:
							{
								num = 279;
								break;
							}
							case 24:
							{
								num = 277;
								break;
							}
							default:
							{
								num = sourceCode;
								return num;
							}
						}
						break;
					}
				}
			}
			else if (num1 <= 32)
			{
				if (num1 != 29)
				{
					if (num1 == 32)
					{
						num = 768;
						return num;
					}
					num = sourceCode;
					return num;
				}
				num = 264;
			}
			else if (num1 == 641)
			{
				num = 16404;
			}
			else
			{
				if (num1 != 1538)
				{
					num = sourceCode;
					return num;
				}
				num = 1538;
			}
			return num;
		}

		public static int TrafficProtocolCodeExchange2(int sourceCode)
		{
			int num;
			int num1 = sourceCode;
			if (num1 <= 17)
			{
				switch (num1)
				{
					case 3:
					{
						num = 515;
						break;
					}
					case 4:
					{
						num = sourceCode;
						return num;
					}
					case 5:
					{
						num = 1028;
						break;
					}
					default:
					{
						if (num1 == 8)
						{
							num = 285;
							break;
						}
						else if (num1 == 17)
						{
							num = 1030;
							break;
						}
						else
						{
							num = sourceCode;
							return num;
						}
					}
				}
			}
			else if (num1 == 30)
			{
				num = 270;
			}
			else if (num1 == 293)
			{
				num = 2305;
			}
			else
			{
				if (num1 != 2306)
				{
					num = sourceCode;
					return num;
				}
				num = 2306;
			}
			return num;
		}

		public enum AlarmPoint
		{
			起点站 = 1,
			经停站 = 2,
			终点站 = 4,
			停车点 = 8
		}

		public enum CallControlFlagValue
		{
			呼入 = 1,
			呼出 = 2,
			抢答 = 4
		}

		public enum CamaraCaptureCache
		{
			立即上传 = 0,
			缓存在终端 = 1
		}

		public enum CamaraMonitorFlagValue
		{
			定时监控 = 1,
			紧急报警监控 = 2,
			重车监控 = 12,
			开ACC监控 = 16384,
			防盗监控 = 32768,
			车门开合监控 = 131072,
			自定义1监控IO1 = 16777216,
			自定义2监控适配器0 = 33554432,
			自定义3监控适配器1 = 67108864,
			自定义4监控适配器2 = 134217728,
			自定义5监控适配器3 = 268435456,
			自定义6监控适配器4 = 536870912
		}

		public enum CamaraWhenStop
		{
			拍照,
			不拍照
		}

		public enum CAPTURE
		{
			CAPTURE_TIME = 1,
			CAPTURE_CARDOOR = 131072
		}

		public enum CarAlarmState : long
		{
			定位状态 = 1,
			劫警 = 2,
			求助 = 16,
			位移 = 32,
			超时停车报警 = 64,
			超时驾驶报警 = 128,
			欠压 = 256,
			掉电 = 512,
			入区域 = 1024,
			出区域 = 2048,
			超速 = 4096,
			偏移路线 = 8192,
			ACC状态 = 16384,
			防盗报警 = 32768,
			非法点火 = 65536,
			车门 = 131072,
			车窗 = 262144,
			前盖 = 524288,
			后盖 = 1048576,
			探测 = 2097152,
			油箱 = 4194304,
			刹车 = 8388608,
			终端IO1输入 = 16777216,
			适配器S0 = 33554432,
			适配器S1 = 67108864,
			适配器S2 = 134217728,
			适配器S3 = 268435456,
			适配器S4 = 536870912,
			加速度报警 = 1073741824,
			加速度计故障报警 = 2147483648
		}

		public enum CarAlarmTypeTag
		{
			配置报警标志位 = 259,
			配置终端文本SMS报警通知开关 = 16392,
			配置报警拍摄开关 = 16393,
			配置报警拍摄存储标志 = 16394,
			配置关键报警标志 = 16395
		}

		public class CarType
		{
			public static string SG2000I;

			public static string SG2000II;

			public static string XTG088;

			public static string GK110A5;

			public static string FT8000S;

			public static string DRGPS;

			static CarType()
			{
				CmdParam.CarType.SG2000I = "SG2000I";
				CmdParam.CarType.SG2000II = "SG2000II";
				CmdParam.CarType.XTG088 = "XT-G088";
				CmdParam.CarType.GK110A5 = "GK-110A5";
				CmdParam.CarType.FT8000S = "FT8000S";
				CmdParam.CarType.DRGPS = "DRGPS";
			}

			public CarType()
			{
			}
		}

		public enum CmdCode
		{
			设置区域 = 15,
			设置限拨的电话号码JTB = 258,
			查询终端标志位 = 262,
			断开GPRS连接 = 263,
			区域报警设置 = 271,
			复位 = 272,
			自检 = 285,
			设置超时停车报警 = 289,
			设置超时驾驶报警 = 290,
			设置通话时间限制 = 291,
			设置盲区补偿 = 292,
			获取终端版本 = 295,
			设置签到汇报 = 297,
			配置自定义报警器 = 300,
			修改终端总里程值 = 301,
			设置车台温度报警 = 303,
			获取车台温度 = 314,
			设置兴趣点信息 = 315,
			删除兴趣点 = 316,
			设置多功能区域报警 = 317,
			设置油量报警阈值 = 318,
			配置油量检测参考值 = 319,
			配置串口参数 = 320,
			配置功能开关 = 322,
			置安全中心 = 324,
			配置dvr低码流录像质量 = 325,
			本地导航开关 = 326,
			设置休眠 = 327,
			驾培查询 = 328,
			设置分段超速报警 = 329,
			设置个人定位亲情号码 = 333,
			设置个人定位终端时间 = 334,
			停止监控 = 516,
			握手 = 517,
			停止轮询监控 = 520,
			请求黑匣子数据上传 = 523,
			电召指令 = 770,
			分流短信 = 781,
			被动监听 = 1026,
			结束报警 = 1028,
			取消区域报警 = 1029,
			取消路线报警 = 1030,
			取消超速报警 = 1031,
			重置车台超级密码 = 1034,
			重置车台管理密码 = 1035,
			重置车台通话密码 = 1036,
			重置车台防盗密码 = 1037,
			重工项目锁车 = 1040,
			停止摄像头监控 = 2306,
			摄像头休眠 = 2307,
			上传某时间段某状态的条件监控数据 = 2308,
			删除某时间之前的图片 = 2309,
			清除所有图片 = 2310,
			上传DVR数据 = 2312,
			带时间段的超速设置 = 4097,
			区域内超速报警设置 = 4098,
			行车记录设置 = 4099,
			报警参数设置 = 4100,
			区域超时停车报警设置 = 4101,
			区域外罐车反转报警设 = 4102,
			区域设置 = 4103,
			设置限拨的电话号码 = 4104,
			设置取消限拨的电话号 = 4105,
			控制车机通话权限 = 4106,
			设置一级短信 = 4107,
			设置GPRS链接维持报文 = 4108,
			图像设置指令 = 4109,
			图像名称查询指令 = 4110,
			获取指定图片上传指令 = 4111,
			抢答确认指令 = 4112,
			设置计价器 = 4113,
			查询计价器 = 4114,
			开启油耗功能 = 4115,
			LED开启或关闭 = 4116,
			LED短信下发 = 4117,
			LED删除指定LED短信 = 4118,
			LED短信属性设置 = 4119,
			LED屏亮度设置 = 4120,
			定时监控查看 = 8193,
			定距监控查看 = 8194,
			事故疑点数据 = 8195,
			历史轨迹 = 8196,
			驾驶员身份功能 = 8197,
			远程参数查看 = 8198,
			远程参数设置 = 8199,
			断电 = 65281,
			断电恢复 = 65282,
			闭锁 = 65283,
			开锁 = 65284,
			取消越出区域报警 = 65285,
			取消进入区域报警 = 65286
		}

		public enum CommMode
		{
			未知方式 = -1,
			短信 = 0,
			GPRSCDMA = 1,
			混合方式 = 2
		}

		public enum CommModule
		{
			短信模块 = 1,
			GPRSCDMA模块 = 2
		}

		public enum IodeviceType
		{
			华翰报站器 = 1,
			挪洋电子铅封 = 2,
			华翰LED = 3,
			重庆计价器 = 4,
			安运学时仪 = 5,
			大同计价器 = 6,
			南京通用计价器 = 13
		}

		public enum IsCompressed
		{
			单次传送,
			压缩传送
		}

		public enum IsUseProxy
		{
			不使用代理 = 0,
			使用代理 = 1
		}

		public enum LoginType
		{
			CarNum,
			CarId,
			SimNum
		}

		public enum MsgType
		{
			UCS2手机短信 = 0,
			普通调度信息 = 1,
			电召信息 = 2,
			调度类信息 = 3,
			详细调度信息 = 3,
			自定义超速报警 = 6,
			一键导航 = 11,
			走马灯 = 12,
			菜单类信息 = 13,
			是否类信息 = 15,
			广告类信息 = 16,
			公司类信息 = 17,
			公众类信息 = 18,
			CAN故障码信息 = 32,
			其他手机短信 = 240,
			掉线短信通知 = 241,
			短信查车 = 241,
			报警短信通知 = 242,
			紧急信息 = 641,
			固定信息点播 = 1538,
		}

		public enum OrderCode
		{
			取消多功能区域报警 = -1029,
			显示越出报警区域 = -1028,
			显示进入报警区域 = -1027,
			显示多功能越出报警区域 = -1026,
			显示多功能进入报警区域 = -1025,
			预设报警区域 = -1024,
			预设多功能报警区域 = -1023,
			预设报警路线 = -1022,
			设置三级路面报警 = -105,
			设置夜间时间平台 = -104,
			设置公交路线报警 = -103,
			设置车辆按时到离站 = -102,
			设置集中停放车辆 = -101,
			黑匣子采样 = -26,
			设置区域报警 = -15,
			关闭报警路线动态下载 = -10,
			短信强制复位 = -2,
			末次位置查询 = -1,
			位置查询 = 0,
			初始化命令 = 1,
			实时监控 = 2,
			压缩监控 = 3,
			停止监控 = 4,
			停止报警 = 5,
			设置越出报警区域值 = 6,
			设置进入报警区域值 = 7,
			自检 = 8,
			断电 = 9,
			断电恢复 = 10,
			解锁 = 11,
			锁车 = 12,
			调度 = 13,
			取消越出报警区域值 = 14,
			取消进入报警区域值 = 15,
			设置偏移路线报警 = 16,
			取消偏移路线报警 = 17,
			定时抓拍图像监控 = 18,
			取消定时抓拍图像监控 = 19,
			实时点名查询 = 20,
			给报警车辆的车主发短信 = 23,
			点对点电召 = 24,
			设置黑匣子采集定时 = 25,
			设置黑匣子采集定距 = 26,
			设置车台通讯方式 = 27,
			设置车台报警器 = 28,
			设置GPRS参数 = 29,
			设置超速报警 = 30,
			取消超速报警 = 31,
			远程升级车台软件 = 32,
			设置车台呼叫限制 = 33,
			多种条件图像监控 = 34,
			设置轮询监控 = 35,
			停止黑匣子采样 = 36,
			使用预设路线设置命令 = 37,
			终端最小汇报间隔 = 38,
			设置移动监控中心号码 = 40,
			呼车 = 50,
			监听 = 51,
			呼外线 = 52,
			设置调度汇报中心号 = 65,
			修改监控中心号码 = 66,
			设置语音报警电话号码 = 67,
			设置中心监听号码 = 68,
			设置监控中心号码 = 69,
			设置医疗服务电话号码 = 70,
			设置维修服务电话号码 = 71,
			设置救助服务电话号码 = 72,
			停机时间命令 = 132,
			设置限拨的电话号码JTB = 258,
			查询终端参数配置 = 262,
			断开GPRS连接 = 263,
			查询终端属性 = 265,
			上报驾驶员身份信息请求 = 267,
			区域报警设置 = 271,
			设置车台复位 = 272,
			设置出租车监控 = 276,
			设置超时停车报警 = 289,
			设置超时驾驶报警 = 290,
			设置通话时间限制 = 291,
			设置盲区补偿 = 292,
			实时图像监控 = 293,
			获得车台终端的软件版本 = 295,
			设置车台参数 = 297,
			设置自定义报警器 = 300,
			设置车台总里程 = 301,
			设置温度报警 = 303,
			获得当前车台温度 = 314,
			下载兴趣点 = 315,
			设置多功能区域报警 = 317,
			设置油量报警阈值 = 318,
			配置油量检测参考值 = 319,
			配置串口参数 = 320,
			开启报警路线动态下载 = 322,
			驾培信息查询 = 328,
			设置分路段超速报警 = 329,
			设置个人定位亲情号码 = 333,
			设置个人定位终端时间 = 334,
			回拔坐席电话指令 = 335,
			设置禁驾报警 = 339,
			设置超速预警 = 340,
			设置CAN采集间隔 = 341,
			设置油耗仪参数 = 342,
			设置出入口分段超速报警 = 346,
			设置夜间时间 = 347,
			设置出入口分段超速报警_公里 = 348,
			设置油耗仪模拟量 = 349,
			设置急加速参数 = 352,
			设置急减速参数 = 353,
			设置发动机超转参数 = 354,
			设置超长怠速允许时长 = 355,
			疲劳驾驶仪设置 = 368,
			设置多功能区域报警应答 = 461,
			多条件实时位置监控 = 512,
			停止轮询监控 = 520,
			设置黑匣子数据上传 = 523,
			发送调度信息 = 768,
			电召指令 = 770,
			拨打电话号码 = 773,
			发送点对点电召 = 775,
			开启油耗仪 = 776,
			关闭油耗仪 = 777,
			油耗仪参数配置 = 778,
			设置油耗仪异常报警阀值 = 779,
			设置油量过少阀值 = 780,
			分流短信 = 781,
			查询油耗仪参数 = 782,
			展博屏一键导航 = 787,
			展博屏分流短信 = 788,
			设置重点监控 = 911,
			设置被动监听 = 1026,
			取消报警区域值 = 1029,
			超时驾驶时间清零 = 1033,
			修改车台超级密码 = 1034,
			重置车台管理密码 = 1035,
			重置车台通话密码 = 1036,
			重置车台防盗密码 = 1037,
			重工项目锁车 = 1040,
			取消超速预警 = 1041,
			取消出入口分段超速报警 = 1042,
			点播菜单设置 = 1537,
			固定信息点播 = 1538,
			设置语音播报 = 1541,
			信息服务 = 1542,
			图像拍照指令 = 2305,
			停止图像监控 = 2306,
			摄像头休眠 = 2307,
			终端图片上传 = 2308,
			根据条件删除图片 = 2309,
			删除所有图片 = 2310,
			根据条件获得黑匣子图片 = 2311,
			数据透传 = 2562,
			透传数据命令 = 2562,
			命令透传 = 2563,
			北斗数据透传 = 2564,
			带时间段的超速设置 = 4097,
			区域内超速报警设置 = 4098,
			行车记录设置 = 4099,
			报警参数设置 = 4100,
			区域超时停车报警设置 = 4101,
			区域外罐车反转报警设置 = 4102,
			区域设置 = 4103,
			设置限拨的电话号码 = 4104,
			设置取消限拨的电话号 = 4105,
			控制车机通话权限 = 4106,
			设置一级短信 = 4107,
			设置GPRS链接维持报文 = 4108,
			图像设置指令 = 4109,
			图像名称查询指令 = 4110,
			获取指定图片上传指令 = 4111,
			抢答确认指令 = 4112,
			设置计价器 = 4113,
			查询计价器 = 4114,
			开启油耗功能 = 4115,
			LED开启或关闭 = 4116,
			LED短信下发 = 4117,
			LED删除指定LED短信 = 4118,
			LED短信属性设置 = 4119,
			LED屏亮度设置 = 4120,
			LBS位置查询 = 4121,
			定时监控查看 = 8193,
			定距监控查看 = 8194,
			事故疑点数据 = 8195,
			历史轨迹 = 8196,
			驾驶员身份 = 8198,
			远程参数查看 = 8199,
			远程参数设置 = 8200,
			查询2个日历天内超时驾驶 = 8272,
			查询累计里程 = 8273,
			设置特征系数 = 8274,
			采集行驶速度数据 = 8275,
			采集驾驶证号及对应的机动车驾驶证号 = 8449,
			采集记录仪的实时时钟 = 8450,
			采集超时驾驶记录2012 = 8451,
			采集记录仪中的车辆特征系数 = 8452,
			查询累计里程2012 = 8453,
			采集车辆VIN号和车牌号码以及车牌分类 = 8454,
			采集记录仪中事故疑点数据 = 8455,
			采集行驶速度数据2012 = 8456,
			采集记录仪中事故疑点数据2012 = 8457,
			采集位置信息记录2012 = 8458,
			采集驾驶人身份记录2012 = 8459,
			采集记录仪外部供电记录2012 = 8460,
			采集记录仪参数修改记录2012 = 8461,
			采集速度状态日志2012 = 8462,
			采集记录仪执行标准版本2012 = 8463,
			采集当前驾驶人信息2012 = 8464,
			采集记录仪实时时间2012 = 8465,
			采集记录仪脉冲系数2012 = 8466,
			采集车辆信息2012 = 8467,
			采集记录仪状态信号配置信息2012 = 8468,
			采集记录仪唯一性编号2012 = 8469,
			设置驾驶员代码和驾驶证号码 = 8705,
			设置记录仪中的车辆VIN号和车牌号以及车牌分类 = 8706,
			设置记录仪时钟 = 8707,
			设置车辆信息2012 = 8708,
			设置记录仪初次安装日期2012 = 8709,
			设置状态量配置信息2012 = 8710,
			设置记录仪时间2012 = 8711,
			设置记录仪脉冲系数2012 = 8712,
			设置初始里程2012 = 8713,
			设置终端心跳发送间隔 = 16385,
			设置应答超时时间和重传次数 = 16386,
			监控平台电话号码 = 16387,
			复位电话号码 = 16388,
			恢复出厂设置电话号码 = 16389,
			接收终端SMS文本报警号码 = 16390,
			终端电话接听策略 = 16391,
			当天累计驾驶时间门限 = 16396,
			设置图片参数 = 16397,
			设置省市域ID = 16398,
			设置车牌和车牌颜色 = 16399,
			无线升级 = 16400,
			终端关机 = 16401,
			关闭所有无线通信 = 16402,
			临时位置跟踪控制 = 16403,
			紧急信息 = 16404,
			事件设置 = 16405,
			发送提问 = 16406,
			设置电话本 = 16407,
			多媒体数据检索 = 16411,
			多媒体数据上传 = 16412,
			录音命令 = 16413,
			控制终端连接 = 16414,
			监管平台特权短信号码 = 16415,
			设置电子围栏半径 = 16417,
			单条存储多媒体数据检索上传命令 = 16418,
			GNSS参数设置 = 16419,
			CAN参数设置 = 16420,
			碰撞参数设置 = 16421,
			扩展终端参数查询 = 16422,
			CANID参数设置 = 16423,
			超速或疲劳驾驶预警差值 = 16426,
			侧翻报警参数设置 = 16427,
			定时拍照控制 = 16428,
			定距拍照控制 = 16429,
			人工确认报警消息 = 16430,
			下发终端升级包 = 16431,
			设置搅拌车正反转 = 16641,
			下发终端详细地址信息 = 16642,
			设置关键区域 = 16643,
			取消所有关键区域 = 16644,
			道路运输证IC卡认证服务器设置 = 16687,
			补发车辆定位信息请求 = 16897,
			申请交换指定车辆定位信息请求 = 16898,
			取消交换指定车辆定位信息请求 = 16899,
			平台查岗应答 = 16900,
			上报警情信息 = 16901,
			报警督办应答 = 16902,
			车辆动态信息补发请求 = 16903,
			下发平台间报文应答 = 16904,
			主动上报报警处理结果信息 = 16905,
			设置行政区域报警 = 43522,
			液晶屏显示 = 57345,
			删除液晶屏文本 = 57346,
			液晶屏开关控制 = 57347,
			液晶屏校时 = 57348,
			液晶屏报警显示 = 57349,
			关闭保警显示 = 57350,
			设置广告时段 = 57351,
			删除广告时段 = 57352,
			设置开机报告 = 57353,
			调光 = 57354,
			设置计时 = 57355,
			手机监控 = 65281
		}

		public class OrderType
		{
			public static int RealTime;

			public static int Compress;

			public static int SelfTest;

			public static int RemoteUp;

			public static int Terminal;

			public static int Command;

			public static int QueryFlag;

			public static int SendMsg;

			static OrderType()
			{
				CmdParam.OrderType.RealTime = 65;
				CmdParam.OrderType.Compress = 66;
				CmdParam.OrderType.SelfTest = 67;
				CmdParam.OrderType.RemoteUp = 68;
				CmdParam.OrderType.Terminal = 69;
				CmdParam.OrderType.Command = 240;
				CmdParam.OrderType.QueryFlag = 70;
				CmdParam.OrderType.SendMsg = -1;
			}

			public OrderType()
			{
			}
		}

		public enum ParamType
		{
			CarNum,
			CarId,
			SimNum
		}

		public enum PhoneType
		{
			报警号码 = 1,
			求助号码 = 4,
			VCC号码 = 13,
			调度汇报中心号码 = 21,
			中心监听电话号码 = 23,
			初始化监控中心号码 = 24,
			医疗救护电话号码 = 25,
			维修电话号码 = 26,
			移动监控中心号码 = 40,
			一键导航通话号码 = 67,
			监控平台SMS电话号码 = 277,
			监控平台电话号码 = 16387,
			复位电话号码 = 16388,
			恢复出厂设置电话号码 = 16389,
			接收终端SMS文本报警号码 = 16390,
			监管平台特权短信号码 = 16415
		}

		public enum PhoneTypeField
		{
			DTMFAlarmNum = 1,
			HelpNum = 4,
			ReportCenterNum = 21,
			ListenRecordNum = 23,
			HaveOwnTele = 24,
			MedicalNum = 25,
			RepairNum = 26,
			MobileCenter = 40,
			MonitoringNum = 16387,
			ResettingNum = 16388,
			ResumeSettingNum = 16389,
			ReceivingSMS = 16390,
			PrivilegeNum = 16415
		}

		public enum RegionType
		{
			越出区域 = 0,
			进入区域 = 1,
			进入越出区域 = 2,
			关闭数据拨号 = 160,
			关闭GSM模块 = 192
		}

		public enum ReportType
		{
			停止汇报 = 0,
			定时汇报 = 1,
			定距汇报 = 2,
			定次汇报 = 3,
			轮询监控 = 7
		}

		public enum ReportWhenStop
		{
			不汇报 = 0,
			汇报 = 1
		}
	}
}